class ProductDiscounts:
    """
    Сервис получения скидок на товары
    """
    def all_discounts(self):
        """
        Получение всех скидок на указанный список товаров или на один товар
        """
        pass

    def priority_discount(self):
        """
        Получение приоритетной скидки на указанный список товаров
        или на один товар
        """
        pass

    def discounted_price(self):
        """
        Рассчитать цену со скидкой на товар с дополнительным
        необязательным параметром 'Цена товара'
        """
        pass
